{
  "data": [
    {
      "id": "invernadero",
      "href": "/project/invernadero",
      "title": "Invernadero",
      "description": "Aplicación web para el monitoreo de temperatura, humedad e iluminación de invernaderos.",
      "internalDetails": {
        "images": ["/invernadero.png"],
        "title": "Monitor de invernaderos",
        "description": "Se trata de un controlador electrónico que permite al usuario accedear a la data histórica de temperatura, humedad y luminosidad de su invernadero. <br /><br />El dispositivo se encuentra armado alrededor del microcontrolador ESP8266, programado para obtener los valores de los sensores cada 15 minutos y realizar un POST a un servidor externo.<br /><br />El servidor consiste de una aplicación realizada en Node/Express que toma la data otorgada por el dispositivo y la guarda en una base de datos MySQL. Luego el usuario puede acceder a la data de su dispositivo iniciando sesión en la página web. <br /><br />Para probar la app se puede ingresar con usuario y contraseña 'guest123'.",
        "githubLink": "https://github.com/haykodarb/nodejs_greenhouse",
        "webLink": "https://kassen.hayk.ar/"
      }
    },
    {
      "id": "termotanque",
      "href": "/project/termotanque",
      "title": "Termotanque",
      "description": "Controlador electrónico para termotanques solares con interfaz por aplicación movil.",
      "internalDetails": {
        "images": ["/termotanque1.jpg", "/termotanque2.jpg","/termotanque3.jpg"],
        "title": "Controlador de termotanque solar.",
        "description": "Se trata de un controlador electrónico que permite al usuario acceder a un dispositivo encargado de controlar la resistencia eléctrica de un termotanque solar. <br /><br />El dispositivo se encuentra armado alrededor del microcontrolador ESP8266, programado para obtener los valores de los sensores, encender o apagar un relé mecánico en función de los mismos. <br /><br /> El microcontrolador actúa como WebServer, sirviendo información mediante WebSockets y por HTTP, al cual el usuario accede de manera local a través de una aplicación movil. <br /><br />Dicha aplicación está desarrollada en Flutter, con capacidad de conectarse a distintos dispositivos simultáneamente, acceder a data histórica del dispositivo y ajustar los parámetros de control del dispositivo."
      }
    },
    {
      "id": "prettykitty",
      "href": "/project/prettykitty",
      "title": "Pretty Kitty Twitty",
      "description": "Bot de Twitter para subir fotos de gatitos desde la cuenta del usuario de manera periódica.",
      "internalDetails": {
        "images": ["/prettykitty.png"],
        "title": "Pretty Kitty Twitty",
        "description": "Consiste de un bot de Twitter al que uno inicia sesión con su propia cuenta. El usuario entonces puede subir imágenes de gatitos y esperar a que el bot las suba periódicamente. <br /><br />Utiliza una API externa para filtrar el contenido de las imágenes antes de subirlas a una base de datos mongoDB. Luego un cronjob se encarga de twittear una de las fotos cada 3 horas.",
        "githubLink": "https://github.com/haykodarb/node_prettykittytwitty",
        "webLink": "https://prettykittytwitty.hayk.ar/"
      }
    }
  ]
}
